# Insert

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"name":["sai","Anil","Venkat"],"Telugu":[90,20,35],"English":[59,95,68]})
df

     name  Telugu  English
0     sai      90       59
1    Anil      20       95
2  Venkat      35       68

In [17]:
#df.insert(col_index,col_name,value)
df.insert(2,'Hindi',df["Telugu"])

In [18]:
df

     name  Telugu  Hindi  English
0     sai      90     90       59
1    Anil      20     20       95
2  Venkat      35     35       68

In [19]:
df.insert(3,'Maths',[99,58,63])

In [20]:
# df.drop(columns=["Hindi"], inplace=True)
df

     name  Telugu  Hindi  Maths  English
0     sai      90     90     99       59
1    Anil      20     20     58       95
2  Venkat      35     35     63       68

In [21]:
df.insert(3,'Maths',[99,58,63])

ValueError: cannot insert Maths, already exists

In [23]:
df.insert(3,'Physics',[99,58])

ValueError: Length of values (2) does not match length of index (3)

In [25]:
df.insert(3,'Physics')

TypeError: DataFrame.insert() missing 1 required positional argument: 'value'

In [26]:
df

     name  Telugu  Hindi  Maths  English
0     sai      90     90     99       59
1    Anil      20     20     58       95
2  Venkat      35     35     63       68

In [27]:
df["Physics"] = df["Maths"][:2]

In [28]:
df

     name  Telugu  Hindi  Maths  English  Physics
0     sai      90     90     99       59     99.0
1    Anil      20     20     58       95     58.0
2  Venkat      35     35     63       68      NaN

# Delete

In [29]:
df

     name  Telugu  Hindi  Maths  English  Physics
0     sai      90     90     99       59     99.0
1    Anil      20     20     58       95     58.0
2  Venkat      35     35     63       68      NaN

In [32]:
df["Chem"] = df["Physics"]

In [33]:
df

     name  Telugu  Hindi  Maths  English  Physics  Chem
0     sai      90     90     99       59     99.0  99.0
1    Anil      20     20     58       95     58.0  58.0
2  Venkat      35     35     63       68      NaN   NaN

In [34]:
df.pop("Chem")

0    99.0
1    58.0
2     NaN
Name: Chem, dtype: float64

In [35]:
df

     name  Telugu  Hindi  Maths  English  Physics
0     sai      90     90     99       59     99.0
1    Anil      20     20     58       95     58.0
2  Venkat      35     35     63       68      NaN

In [36]:
del df["Hindi"]

In [37]:
df

     name  Telugu  Maths  English  Physics
0     sai      90     99       59     99.0
1    Anil      20     58       95     58.0
2  Venkat      35     63       68      NaN

In [40]:
df.drop(columns=["Telugu"])

     name  Maths  English  Physics
0     sai     99       59     99.0
1    Anil     58       95     58.0
2  Venkat     63       68      NaN

In [41]:
df

     name  Telugu  Maths  English  Physics
0     sai      90     99       59     99.0
1    Anil      20     58       95     58.0
2  Venkat      35     63       68      NaN

In [42]:
df.drop(columns=["Telugu"], inplace=True)

In [43]:
df

     name  Maths  English  Physics
0     sai     99       59     99.0
1    Anil     58       95     58.0
2  Venkat     63       68      NaN